# 데이터 연결하기 실습
* concat 메소드로 데이터 연결하기
* merge 메소드 사용하기

In [1]:
import pandas as pd

### 문제 1
다음과 같은 데이터프레임을 생성하시오.
```
df1 = pd.DataFrame({
    'ID': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    'Name': ['Jane', 'James', 'Michel', 'Sam', 'Suji', 'Kurt', 'Julie']
})
df2 = pd.DataFrame({
    'ID': [1001, 1001, 1005, 1006, 1008, 1001],
    'Deposit': [10000, 20000, 15000, 5000, 100000, 30000]
})
```

In [2]:
df1 = pd.DataFrame({
    'ID': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    'Name': ['Jane', 'James', 'Michel', 'Sam', 'Suji', 'Kurt', 'Julie']
})

df1

     ID    Name
0  1001    Jane
1  1002   James
2  1003  Michel
3  1004     Sam
4  1005    Suji
5  1006    Kurt
6  1007   Julie

In [3]:
df2 = pd.DataFrame({
    'ID': [1001, 1001, 1005, 1006, 1008, 1001],
    'Deposit': [10000, 20000, 15000, 5000, 100000, 30000]
})
df2

     ID  Deposit
0  1001    10000
1  1001    20000
2  1005    15000
3  1006     5000
4  1008   100000
5  1001    30000

### 문제2
merge 명령으로 위의 두 데이터프레임 df1, df2 를 수평으로 합쳐 출력하시오. ID 컬럼과 NO 컬럼을 기준으로 inner join을 수행하시오.

In [4]:
pd.merge(df1, df2)

     ID  Name  Deposit
0  1001  Jane    10000
1  1001  Jane    20000
2  1001  Jane    30000
3  1005  Suji    15000
4  1006  Kurt     5000

### 문제 3
merge를 사용하여 df1, df2 를 join 하는데 full outer join으로 수행하시오.

In [5]:
pd.merge(df1, df2, how='outer')

     ID    Name   Deposit
0  1001    Jane   10000.0
1  1001    Jane   20000.0
2  1001    Jane   30000.0
3  1002   James       NaN
4  1003  Michel       NaN
5  1004     Sam       NaN
6  1005    Suji   15000.0
7  1006    Kurt    5000.0
8  1007   Julie       NaN
9  1008     NaN  100000.0

### 문제 4
merge 대신에 join 명령어를 사용하여 full outer join을 수행하시오.

In [6]:
df1.set_index('ID').join(df2.set_index('ID'), how='outer')

        Name   Deposit
ID
1001    Jane   10000.0
1001    Jane   20000.0
1001    Jane   30000.0
1002   James       NaN
1003  Michel       NaN
1004     Sam       NaN
1005    Suji   15000.0
1006    Kurt    5000.0
1007   Julie       NaN
1008     NaN  100000.0